""" 
|--------------------------------------------------------------|
|-------------------ESTRUCTURAS DE CONTROL---------------------|
|------------------------CONDICIONALES-------------------------|
|--------------------------------------------------------------|
|if condición:-------------------------------------------------|
|---Bloque de código si la condición es True-------------------|
|--------------------------------------------------------------|
|--------------------------------------------------------------|
|--------------------------------------------------------------|
|if condición:-------------------------------------------------|
|---Bloque de código si la condición es True-------------------|
|else:---------------------------------------------------------|
|---Bloque de código si la condición if es False---------------|
|--------------------------------------------------------------|
|--------------------------------------------------------------|
|--------------------------------------------------------------|
|if condición:-------------------------------------------------|
|---Bloque de código si la condición es True-------------------|
|elif condición:-----------------------------------------------|
|---Bloque de código si la condición if es False---------------|
|else:---------------------------------------------------------|
|---Bloque de código si ambas condiciones anteriores son False-|
|--------------------------------------------------------------|
"""
import random
i = random.randint(1, 11)

if i < 5:
    print("La primera condición a sido aceptada")
elif i < 7 and i > 5:
    print("La primera condición ha sido rechazada")
elif i <= 10 and i > 7:
    print("Pueden haver varios elif, se otorga otra condición")
else:
    print("No ha aceptado ninguna de las condiciones")

    
